In [1]:
# missing data, dropna, fillna, nan, thresh, value

In [6]:
import numpy as np
import pandas as pd

In [10]:
d = {'A':[1,2,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3]}

In [15]:
# construct DataFrame using the dictionary
df = pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
# dropna method; drop data with NAN values
# default axis=0 ; operation along the row
df.dropna()

     A    B  C
0  1.0  5.0  1

In [18]:
# axis=1 ; operations along the column
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [22]:
# threshold for number of NAN elements, retain non-NAN values till the given number
df.dropna(thresh=2)
# minimum 2 non-NAN values per row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [23]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [25]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [28]:
 # fill values with Mean of column A
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64